In [1]:
import pandas as pd
s1=pd.Series()
print(s1)
print(type(s1))

Series([], dtype: float64)
<class 'pandas.core.series.Series'>

C:\Users\azart\AppData\Local\Temp\ipykernel_8276\263796719.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1=pd.Series()

In [2]:
import pandas as pd
import numpy as np
arr=np.array([10,20,30,40,50])
s1=pd.Series(arr)
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [5]:
data={'a':10,'b':20,'c':30}
s1=pd.Series(data)
print(s1)

a    10
b    20
c    30
dtype: int64

In [7]:
s1=pd.Series([10,20,30,40,50])
print(s1[1:4])

1    20
2    30
3    40
dtype: int64

In [ ]:
#DataFrame

In [8]:
listx=[10,20,30,40]
t1=pd.DataFrame(listx)
print(t1)

    0
0  10
1  20
2  30
3  40

In [9]:
data=[{'a':1,'b':2},{'a':2,'b':4,'c':8}]
table=pd.DataFrame(data)
print(table)

   a  b    c
0  1  2  NaN
1  2  4  8.0

In [10]:
data=[{'a':1,'b':2},{'a':2,'b':4,'c':8}]
table=pd.DataFrame(data,index=['first','second'])
print(table)

        a  b    c
first   1  2  NaN
second  2  4  8.0

In [13]:
data={'one':pd.Series([1,2,3,4],index=['a','b','c','d']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
print(table)

   one  two
a    1    1
b    2    2
c    3    3
d    4    4

In [ ]:
#DataFrame-Addition and deletion of columns

In [15]:
data={'one':pd.Series([1,2,3],index=['a','b','c']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
print(table)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [21]:
data={'one':pd.Series([1,2,3,4],index=['a','b','c','d']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
table['three']=pd.Series([10,20,30],index=['a','b','c'])
print(table)

   one  two  three
a    1    1   10.0
b    2    2   20.0
c    3    3   30.0
d    4    4    NaN

In [17]:
del table['one']
print(table)

   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN

In [19]:
table.pop('two')
print(table)

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [ ]:
#Dataframe-Add and delete the row

In [22]:
print(table)

   one  two  three
a    1    1   10.0
b    2    2   20.0
c    3    3   30.0
d    4    4    NaN

In [23]:
print(table.loc['c'])

one       3.0
two       3.0
three    30.0
Name: c, dtype: float64

In [24]:
print(table.iloc[2])

one       3.0
two       3.0
three    30.0
Name: c, dtype: float64

In [7]:
data={'one':pd.Series([1,2,3,4],index=['a','b','c','d']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
table['three']=pd.Series([10,20,30],index=['a','b','c'])
print(table)
row=pd.DataFrame([[11,13],[17,19]],columns=['two','three'])
table=table.append(row)
print(table)

   one  two  three
a    1    1   10.0
b    2    2   20.0
c    3    3   30.0
d    4    4    NaN
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  4.0    4    NaN
0  NaN   11   13.0
1  NaN   17   19.0

C:\Users\azart\AppData\Local\Temp\ipykernel_8276\1416471002.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  table=table.append(row)

In [8]:
row=pd.DataFrame([[11,13],[17,19]],columns=['two','three'])
table=table.append(row)
table=table.drop('a')
print(table)

   one  two  three
b  2.0    2   20.0
c  3.0    3   30.0
d  4.0    4    NaN
0  NaN   11   13.0
1  NaN   17   19.0
0  NaN   11   13.0
1  NaN   17   19.0

C:\Users\azart\AppData\Local\Temp\ipykernel_8276\389079256.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  table=table.append(row)

In [ ]:
#DataFrame read_csv(),to_csv,read_excel(),to_excel()

In [3]:
df=pd.read_csv('C://Users//azart//Documents//Python_US_DS//Datasets//Position_Salaries.csv')

In [4]:
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5   Regional Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [5]:
print(pd.options.display.max_rows)

60

In [6]:
print(pd.options.display.max_columns)

20

In [11]:
df_test=pd.DataFrame(np.random.rand(4,4),['A','B','C','D'],['W','X','Y','Z'])
df_test

          W         X         Y         Z
A  0.351639  0.317592  0.577042  0.796196
B  0.763643  0.651044  0.660970  0.865041
C  0.610062  0.159068  0.458641  0.824900
D  0.994654  0.196774  0.969530  0.287978

In [15]:
print(df_test[['W','Z']])

          W         Z
A  0.351639  0.796196
B  0.763643  0.865041
C  0.610062  0.824900
D  0.994654  0.287978

In [16]:
print(df_test.loc['A'])

W    0.351639
X    0.317592
Y    0.577042
Z    0.796196
Name: A, dtype: float64

In [17]:
print(df_test.loc[['A'],['W']])

          W
A  0.351639

In [18]:
print(df_test.loc[['A','B'],['W','X']])

          W         X
A  0.351639  0.317592
B  0.763643  0.651044

In [19]:
df_test['NEWCOL']=df_test['W']+df_test['X']
print(df_test)

          W         X         Y         Z    NEWCOL
A  0.351639  0.317592  0.577042  0.796196  0.669231
B  0.763643  0.651044  0.660970  0.865041  1.414687
C  0.610062  0.159068  0.458641  0.824900  0.769130
D  0.994654  0.196774  0.969530  0.287978  1.191428

In [20]:
df_test.shape

(4, 5)

In [21]:
print(df_test[(df_test['NEWCOL']>1)])

          W         X        Y         Z    NEWCOL
B  0.763643  0.651044  0.66097  0.865041  1.414687
D  0.994654  0.196774  0.96953  0.287978  1.191428

In [22]:
df_test

          W         X         Y         Z    NEWCOL
A  0.351639  0.317592  0.577042  0.796196  0.669231
B  0.763643  0.651044  0.660970  0.865041  1.414687
C  0.610062  0.159068  0.458641  0.824900  0.769130
D  0.994654  0.196774  0.969530  0.287978  1.191428

In [23]:
df_test.to_excel('test1.xlsx',sheet_name="mysheet")
print(df_test)

          W         X         Y         Z    NEWCOL
A  0.351639  0.317592  0.577042  0.796196  0.669231
B  0.763643  0.651044  0.660970  0.865041  1.414687
C  0.610062  0.159068  0.458641  0.824900  0.769130
D  0.994654  0.196774  0.969530  0.287978  1.191428

In [25]:
df_test.to_csv('test2.csv')
df_test

          W         X         Y         Z    NEWCOL
A  0.351639  0.317592  0.577042  0.796196  0.669231
B  0.763643  0.651044  0.660970  0.865041  1.414687
C  0.610062  0.159068  0.458641  0.824900  0.769130
D  0.994654  0.196774  0.969530  0.287978  1.191428

In [26]:
titanic=pd.read_csv("titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q